Revit 2017 API
StructuralSectionRectangleParameterized Class
 Defines parameters for parameterized rectangle structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionRectangleParameterized : StructuralSectionRectangular
Visual Basic
Public Class StructuralSectionRectangleParameterized _
	Inherits StructuralSectionRectangular
Visual C++
public ref class StructuralSectionRectangleParameterized : public StructuralSectionRectangular
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized
See Also
StructuralSectionRectangleParameterized Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace